// GENERATED CODE - DO NOT MODIFY BY HAND
import 'package:flutter/material.dart';
import 'package:intl/intl.dart';
import 'intl/messages_all.dart';

// **************************************************************************
// Generator: Flutter Intl IDE plugin
// Made by Localizely
// **************************************************************************

// ignore_for_file: non_constant_identifier_names, lines_longer_than_80_chars
// ignore_for_file: join_return_with_assignment, prefer_final_in_for_each
// ignore_for_file: avoid_redundant_argument_values

class S {
  S();
  
  static S current;
  
  static const AppLocalizationDelegate delegate =
    AppLocalizationDelegate();

  static Future<S> load(Locale locale) {
    final name = (locale.countryCode?.isEmpty ?? false) ? locale.languageCode : locale.toString();
    final localeName = Intl.canonicalizedLocale(name); 
    return initializeMessages(localeName).then((_) {
      Intl.defaultLocale = localeName;
      S.current = S();
      
      return S.current;
    });
  } 

  static S of(BuildContext context) {
    return Localizations.of<S>(context, S);
  }

  /// `ウマグラム`
  String get umagram {
    return Intl.message(
      'ウマグラム',
      name: 'umagram',
      desc: '',
      args: [],
    );
  }

  /// `あなたの個性は宝物`
  String get splash_heading {
    return Intl.message(
      'あなたの個性は宝物',
      name: 'splash_heading',
      desc: '',
      args: [],
    );
  }

  /// `モテる自分に気がつこう`
  String get splash_desc {
    return Intl.message(
      'モテる自分に気がつこう',
      name: 'splash_desc',
      desc: '',
      args: [],
    );
  }

  /// `*自分の魅力診断アプリ`
  String get splash_subtitle {
    return Intl.message(
      '*自分の魅力診断アプリ',
      name: 'splash_subtitle',
      desc: '',
      args: [],
    );
  }

  /// `貴方の魅力を発見する`
  String get intro_title_1 {
    return Intl.message(
      '貴方の魅力を発見する',
      name: 'intro_title_1',
      desc: '',
      args: [],
    );
  }

  /// `まずは無料で診断`
  String get intro_title_2 {
    return Intl.message(
      'まずは無料で診断',
      name: 'intro_title_2',
      desc: '',
      args: [],
    );
  }

  /// `「自信」とは「自分を信じる」と書きます。「自分を信用する」という意味です。貴方は自分を信用していますか？もし貴方が自分を信用できないなら誰が貴方を信じてくれるのでしょうか？貴方が自分自身のことをよく理解することは生きるための基本かもしれません。どんな状態であれ貴方が貴方自身を信じて生きることが、人生の中で貴方を支え、貴方を生かす大きな力となります。\n 　では、どうすれば自分を信用できるようになるのでしょうか。貴方が素晴らしい長所をたくさん持っていることでしょうか？それとも自分の欠点を直し自己改革をすることでしょうか？いえ、そんなやり方では自信は身につきません。 貴方は今のままでいいのです。直すことより大事なことは今の貴方そのものを理解することです。何も変える必要はないのです。自分の長所と短所を知りそれをその時に応じて武器として使い分けて、自分で自分の良さを引き出すことが必要なのです。今は短所でも時間が経ち、状況が変われば長所になることなど沢山ありますから、直す必要なんてありません。自分自身をよく知ることによって今までよりさらに楽しく幸せに生きることができるようになるはずです。\n 　このウマグラムのシステムは貴方の長所や魅力を分析し貴方が今まで気がついていなかった貴方自身の魅力に気づいてもらうことを目的にして作られたものです。`
  String get desc {
    return Intl.message(
      '「自信」とは「自分を信じる」と書きます。「自分を信用する」という意味です。貴方は自分を信用していますか？もし貴方が自分を信用できないなら誰が貴方を信じてくれるのでしょうか？貴方が自分自身のことをよく理解することは生きるための基本かもしれません。どんな状態であれ貴方が貴方自身を信じて生きることが、人生の中で貴方を支え、貴方を生かす大きな力となります。\n 　では、どうすれば自分を信用できるようになるのでしょうか。貴方が素晴らしい長所をたくさん持っていることでしょうか？それとも自分の欠点を直し自己改革をすることでしょうか？いえ、そんなやり方では自信は身につきません。 貴方は今のままでいいのです。直すことより大事なことは今の貴方そのものを理解することです。何も変える必要はないのです。自分の長所と短所を知りそれをその時に応じて武器として使い分けて、自分で自分の良さを引き出すことが必要なのです。今は短所でも時間が経ち、状況が変われば長所になることなど沢山ありますから、直す必要なんてありません。自分自身をよく知ることによって今までよりさらに楽しく幸せに生きることができるようになるはずです。\n 　このウマグラムのシステムは貴方の長所や魅力を分析し貴方が今まで気がついていなかった貴方自身の魅力に気づいてもらうことを目的にして作られたものです。',
      name: 'desc',
      desc: '',
      args: [],
    );
  }

  /// `利用規約`
  String get t_and_c {
    return Intl.message(
      '利用規約',
      name: 't_and_c',
      desc: '',
      args: [],
    );
  }

  /// `プライバシーポリシー`
  String get privacy_policy {
    return Intl.message(
      'プライバシーポリシー',
      name: 'privacy_policy',
      desc: '',
      args: [],
    );
  }

  /// `次へ`
  String get next {
    return Intl.message(
      '次へ',
      name: 'next',
      desc: '',
      args: [],
    );
  }

  /// `概要`
  String get overview {
    return Intl.message(
      '概要',
      name: 'overview',
      desc: '',
      args: [],
    );
  }

  /// `個別項目`
  String get individual_items {
    return Intl.message(
      '個別項目',
      name: 'individual_items',
      desc: '',
      args: [],
    );
  }

  /// `概論`
  String get drawer_item_intro {
    return Intl.message(
      '概論',
      name: 'drawer_item_intro',
      desc: '',
      args: [],
    );
  }

  /// `無料簡易診断`
  String get drawer_item_free {
    return Intl.message(
      '無料簡易診断',
      name: 'drawer_item_free',
      desc: '',
      args: [],
    );
  }

  /// `詳細診断`
  String get drawer_item_paid2 {
    return Intl.message(
      '詳細診断',
      name: 'drawer_item_paid2',
      desc: '',
      args: [],
    );
  }

  /// `自己肯定感診断`
  String get drawer_item_paid3 {
    return Intl.message(
      '自己肯定感診断',
      name: 'drawer_item_paid3',
      desc: '',
      args: [],
    );
  }

  /// `相性診断`
  String get drawer_item_paid4 {
    return Intl.message(
      '相性診断',
      name: 'drawer_item_paid4',
      desc: '',
      args: [],
    );
  }

  /// `動物診断`
  String get drawer_item_paid5 {
    return Intl.message(
      '動物診断',
      name: 'drawer_item_paid5',
      desc: '',
      args: [],
    );
  }

  /// `満足度診断`
  String get drawer_item_paid6 {
    return Intl.message(
      '満足度診断',
      name: 'drawer_item_paid6',
      desc: '',
      args: [],
    );
  }

  /// `運試し`
  String get drawer_item_fortune {
    return Intl.message(
      '運試し',
      name: 'drawer_item_fortune',
      desc: '',
      args: [],
    );
  }

  /// `無料簡易診断`
  String get free_screen_title {
    return Intl.message(
      '無料簡易診断',
      name: 'free_screen_title',
      desc: '',
      args: [],
    );
  }

  /// `貴方のモテ度`
  String get free_screen_result_title {
    return Intl.message(
      '貴方のモテ度',
      name: 'free_screen_result_title',
      desc: '',
      args: [],
    );
  }

  /// `他の診断をする`
  String get free_screen_result_button {
    return Intl.message(
      '他の診断をする',
      name: 'free_screen_result_button',
      desc: '',
      args: [],
    );
  }

  /// `詳細診断`
  String get paid2_screen_title {
    return Intl.message(
      '詳細診断',
      name: 'paid2_screen_title',
      desc: '',
      args: [],
    );
  }

  /// `詳細診断`
  String get paid2_screen_result_title {
    return Intl.message(
      '詳細診断',
      name: 'paid2_screen_result_title',
      desc: '',
      args: [],
    );
  }

  /// ` 自己肯定感診断をする`
  String get paid2_screen_result_button {
    return Intl.message(
      ' 自己肯定感診断をする',
      name: 'paid2_screen_result_button',
      desc: '',
      args: [],
    );
  }

  /// `自己肯定感診断`
  String get paid3_screen_title {
    return Intl.message(
      '自己肯定感診断',
      name: 'paid3_screen_title',
      desc: '',
      args: [],
    );
  }

  /// `自分の性格に当てはまる項目のすべてに チェックをしてください。`
  String get paid3_statement_page1 {
    return Intl.message(
      '自分の性格に当てはまる項目のすべてに チェックをしてください。',
      name: 'paid3_statement_page1',
      desc: '',
      args: [],
    );
  }

  /// `貴方が好きなタイプの人の性格に当てはま る項目全てにチェックしてください。`
  String get paid3_statement_page2 {
    return Intl.message(
      '貴方が好きなタイプの人の性格に当てはま る項目全てにチェックしてください。',
      name: 'paid3_statement_page2',
      desc: '',
      args: [],
    );
  }

  /// `貴方の自己肯定感`
  String get paid3_screen_result_title {
    return Intl.message(
      '貴方の自己肯定感',
      name: 'paid3_screen_result_title',
      desc: '',
      args: [],
    );
  }

  /// `貴方の自己肯定感は以下の通りです`
  String get paid3_screen_result_statement {
    return Intl.message(
      '貴方の自己肯定感は以下の通りです',
      name: 'paid3_screen_result_statement',
      desc: '',
      args: [],
    );
  }

  /// `相性診断をする`
  String get paid3_screen_result_button {
    return Intl.message(
      '相性診断をする',
      name: 'paid3_screen_result_button',
      desc: '',
      args: [],
    );
  }

  /// `相性診断`
  String get paid4_screen_title {
    return Intl.message(
      '相性診断',
      name: 'paid4_screen_title',
      desc: '',
      args: [],
    );
  }

  /// `自分の性格として当てはまるタイプにチェックをしてください`
  String get paid4_statement {
    return Intl.message(
      '自分の性格として当てはまるタイプにチェックをしてください',
      name: 'paid4_statement',
      desc: '',
      args: [],
    );
  }

  /// `貴方の相性が良い相手`
  String get paid4_screen_result_title {
    return Intl.message(
      '貴方の相性が良い相手',
      name: 'paid4_screen_result_title',
      desc: '',
      args: [],
    );
  }

  /// `貴方に相性が良いタイプは 以下の特徴を持っています`
  String get paid4_screen_result_statement {
    return Intl.message(
      '貴方に相性が良いタイプは 以下の特徴を持っています',
      name: 'paid4_screen_result_statement',
      desc: '',
      args: [],
    );
  }

  /// `動物診断をする`
  String get paid4_screen_result_button {
    return Intl.message(
      '動物診断をする',
      name: 'paid4_screen_result_button',
      desc: '',
      args: [],
    );
  }

  /// `動物診断テスト`
  String get paid5_screen_title {
    return Intl.message(
      '動物診断テスト',
      name: 'paid5_screen_title',
      desc: '',
      args: [],
    );
  }

  /// `動物診断テスト`
  String get paid5_screen_result_title {
    return Intl.message(
      '動物診断テスト',
      name: 'paid5_screen_result_title',
      desc: '',
      args: [],
    );
  }

  /// `貴方はこんなイメージの動物です`
  String get paid5_screen_result_statement {
    return Intl.message(
      '貴方はこんなイメージの動物です',
      name: 'paid5_screen_result_statement',
      desc: '',
      args: [],
    );
  }

  /// `満足度診断をする`
  String get paid5_screen_result_button {
    return Intl.message(
      '満足度診断をする',
      name: 'paid5_screen_result_button',
      desc: '',
      args: [],
    );
  }

  /// `満足度テスト`
  String get paid6_screen_title {
    return Intl.message(
      '満足度テスト',
      name: 'paid6_screen_title',
      desc: '',
      args: [],
    );
  }

  /// `当てはまるもの全てにチェックをしてください`
  String get paid6_screen_statement {
    return Intl.message(
      '当てはまるもの全てにチェックをしてください',
      name: 'paid6_screen_statement',
      desc: '',
      args: [],
    );
  }

  /// `満足度結果`
  String get paid6_screen_result_title {
    return Intl.message(
      '満足度結果',
      name: 'paid6_screen_result_title',
      desc: '',
      args: [],
    );
  }

  /// `他人から見た貴方の満足度は 以下の通りです。`
  String get paid6_screen_result_statement {
    return Intl.message(
      '他人から見た貴方の満足度は 以下の通りです。',
      name: 'paid6_screen_result_statement',
      desc: '',
      args: [],
    );
  }

  /// `運試しをする`
  String get paid6_screen_result_button {
    return Intl.message(
      '運試しをする',
      name: 'paid6_screen_result_button',
      desc: '',
      args: [],
    );
  }

  /// `運試し`
  String get fortune_screen_title {
    return Intl.message(
      '運試し',
      name: 'fortune_screen_title',
      desc: '',
      args: [],
    );
  }

  /// `どちらか好きな方を選んでください`
  String get fortune_screen_statement {
    return Intl.message(
      'どちらか好きな方を選んでください',
      name: 'fortune_screen_statement',
      desc: '',
      args: [],
    );
  }

  /// `運試し結果`
  String get fortune_screen_result_title {
    return Intl.message(
      '運試し結果',
      name: 'fortune_screen_result_title',
      desc: '',
      args: [],
    );
  }

  /// `人生には運気も必要です。 貴方の運気は以下の通りです。`
  String get fortune_screen_result_statement {
    return Intl.message(
      '人生には運気も必要です。 貴方の運気は以下の通りです。',
      name: 'fortune_screen_result_statement',
      desc: '',
      args: [],
    );
  }

  /// `TOPへ`
  String get fortune_screen_result_button {
    return Intl.message(
      'TOPへ',
      name: 'fortune_screen_result_button',
      desc: '',
      args: [],
    );
  }

  /// `終了しますか？`
  String get exit {
    return Intl.message(
      '終了しますか？',
      name: 'exit',
      desc: '',
      args: [],
    );
  }

  /// `はい`
  String get yes {
    return Intl.message(
      'はい',
      name: 'yes',
      desc: '',
      args: [],
    );
  }

  /// `いいえ`
  String get no {
    return Intl.message(
      'いいえ',
      name: 'no',
      desc: '',
      args: [],
    );
  }

  /// `うまグラム利用規約\n1.はじめに\n1.1この利用規約（以下「本規約」という。）は、株式会社箸長（以下「当社」といいます。）が提供する「うまグラム」に関連する全ての製品及びサービス（以下「本サービス」といいます。）をご利用いただく際の取り扱いについて、本サービスを利用するお客様（以下「お客様」という。）と当社との間で定めるものです。\n1.2当社が本規約に同意の上、本サービスのユーザーとして登録したもの（以下ユーザーと言います。）に対して、別途以下の各号のものを定めた場合、これらも本規約の一部を構成します。\n1)プライバシーポリシー\n2)当社が本サービスで掲示する諸注意等\n3)本サービスを構成する全ての個別サービスの利用規約・ガイドライン等\n1.3当社は、ユーザーが本サービスを使用することによって健康面や感情面、または商業に関わる利益を保証いたしません。また、本サービス上で提供される情報は、医学的または精神医学、心理学的助言に代わるものではないことにあらかじめ同意の上でユーザーは利用してください。\n1.4本サービスの公式テキストは日本語版のものとします。他の言語への翻訳で作成された矛盾や相違は、拘束力がなく、いかなる目的においても法的効力がないものとします。\n2.定義\n本規約では、以下の用語を使用します。\n2.1「コンテンツ」とは、文章、画像、ソフトウェア、プログラム、コードその他の情報のことをいいます。\n2.2「本コンテンツ」とは、本サービスを通じてアクセスすることができるコンテンツのことを言います。\n3.規約への同意\n3.1本サービスを利用する全てのユーザーは、本規約に従って本サービスを利用しなければなりません。お客様は本規約に同意をしない限り本サービスを利用できません。或いは本サービスの利用開始をもって、本規約に同意したものとみなします。\n3.2ユーザーは、本サービスの利用の都度、本規約の変更の有無を確認し、また変更がなされた場合には、変更後の本規約に同意の上で本サービスを利用していただきます。\n3.3利用者が、本サービスをスマートフォンその他の情報端末にダウンロードし、本規約への同意手続を行った時点で、利用者と当社との間で、本規約の諸規定に従った利用契約が成立するものとします。\n3.4利用者が未成年者である場合には、親権者その他の法定代理人の同意を得たうえで、本サービスをご利用ください。また、お客様が本サービスを事業者のために利用する場合は、当該事業者も本規約に同意した上で本サービスをご利用ください。\n3.5未成年者の利用者が、法定代理人の同意がないにもかかわらず同意があると偽りまたは年齢について成年と偽って本サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合、本サービスに関する一切の法律行為を取り消すことは出来ません。\n3.6本規約の同意時に未成年であった利用者が成年に達した後に本サービスを利用した場合、当該利用者は本サービスに関する一切の法律行為を追認したものとみなされます。\n４.プライバシー\n4.1当社はお客様のプライバシーを尊重しています。\n4.2当社はお客様のプライバシー情報と個人情報を、うまグラムプライバシーポリシーに従って適切に取り扱います。\n5.ユーザーの責任\n5.1ユーザーは、自身の責任において本サービスを利用するものとし、本サービスを利用してなされた一切の行為およびその結果について責任を負います。\n5.2ユーザーは、当社がユーザーの行為に起因して何らかの不利益、負担または損害を被った場合、当社の請求に従い直ちにこれを補償しなければなりません。\n6.ユーザーの禁止行為\n6.1利用者は、本サービスを利用して以下の行為、または以下に該当する恐れのある行為を行ってはいけません。\n１）本サービスを不正の目的をもって利用する行為\n2)当社または第三者の著作権、肖像権、その他知的財産権を侵害する行為\n3)当社または第三者を差別、誹謗中傷、脅迫し、あるいはプライバシー、人権等を侵害する行為\n4)政治活動、選挙活動および宗教活動\n5)当社の名誉・信用を傷付け、信頼を毀損する行為\n6)本サービスの運営を妨げる行為\n7)本サービスを商業目的で利用する行為（当社が認める場合を除く）\n8)本サービスの利用についての再許諾、本サービスの譲渡、変更、翻訳、リバースエンジニアリング、逆コンパイル、逆アセンブルする行為\n9)その他法律、法令、公序良俗に反する行為、またはそのおそれのある行為\n10)その他当社が不適当・不適切と判断した行為\n6.2前項に掲げる行為によって、当社または第三者に損害が生じた場合、ユーザーはすべての法的責任を負うものとし、当社および第三者に損害を与えないものとする。\n6.3当社は、ユーザーが前2項に掲げる行為を行ったと合理的に判断した場合は、事前に通知することなく、本サイトの利用の停止をすることができるものとする。\n7.うまグラム診断\n7.1ユーザーは、本サービスを使用して無料の個人性格診断を受けることができます。\n7.2パーソナリティテストの結果（以下、診断結果という。）は自動的に分析され、アプリ内で解説されます。\n7.3本サービスは、情報や娯楽のユーザー個人の目的でのみ提供され、他の目的で使用されることはありません。\n8.有償コンテンツ\n8.1有償コンテンンツとは「ウマグラム　詳細診断　自己肯定感診断　相性診断　動物診断　満足度診断　運試し」と題する部分のことを指します。\n8.2ユーザーは、有償コンテンツを500円で購入し診断・閲覧することができます。有償コンテンツの金額、決済方法その他の事項は当社が定めるものとします。\n8.3当社は、本サービスにおいて無償または有償とされているコンテンツについて当社の裁量でその価格を変更することがあります。\n8.4有償コンテンツは、これを購入したユーザーのみ利用できるものとする。\n9.有償コンテンツ部分への支払い\n9.1有償コンテンツ部分への支払いは、クレジットカード決済によるものとします。\n9.2. 有償コンテンツ部分への支払いは、当該ユーザーが利用するクレジットカードの発行会社が定める規約に基づき、支払われるものとします。\n9.3. ユーザーは、当社がユーザー登録時に登録を行ったクレジットカード情報について暗号化等の安全化措置を講じるものの、当該情報の秘密性を完全に保持できない場合があることを承諾するものとします。\n9.4ユーザーは、クレジットカードの紛失等によりカード番号が変更となった場合、会員資格を喪失した場合等には、当社に対し速やかにその旨を連絡するものとします。\n10.返金およびキャンセルポリシー\n10.1購入した有償コンテンツは一切払い戻しは行わないものとします。ただし、法令上必要と判断された場合はその限りではありません。\n10.2購入した有償コンテンツの内容は、当社によるコンテンツリニューアルによって内容が変更する場合があります。その場合におきましても、ユーザーはその返金を求めないものとします。\n11.サービスの終了\n11.1当社はユーザーへの適宜の方法で通知することにより、本サービスを終了ですることができるものとします。\n11.2ユーザーは、本サービスが終了した場合、有料コンテンツを利用する権利を一切失い、以後、当該有料コンテンツを利用できなくなることをあらかじめ異議なく同意するものとします。\n11.3当社は、本サービスが原因を問わず終了した場合、これに起因して生じたユーザーまたは第三者が被った被害について、一切責任を負わないものとします。\n12.当社の免責\n12.1当社は、本サービスをユーザーに提供するにあたり、ユーザーが被ったいかなる損害について、法令に定める場合を除き、一切の責任を負いません。なお、当社が責任を負う場合であっても、損害賠償等の金額は、ユーザーが本サービスの利用のために当社に支払った金額を上限とします。\n13.2当社は、ユーザー同士若しくはユーザーと第三者において生じた紛争や損害につき、一切の責任を負いません。\n12.3当社は、本サービス、本サービスにおいて提供される情報、性格診断結果に関して、その正確性、完全性、目的適合性、有用性、適法性、最新性、および第三者の権利を侵害していないことについて、一切保証する義務を負いません。\n13.本サービスの変更、停止または廃止\n13.1当社は、以下各号の事由に起因する場合、本サービスの全部または一部を予告なく停止することができ、かかる停止に起因してユーザーまたは第三者に損害が発生した場合、会社は一切の責任を負いません。\n13.2定期的または緊急に本サービス提供のためのシステムの保守または点検を行う場合\n13.3地震、火災、停電、天災地変等の非常事態により本サービスの運営が不能となった場合\n13.4戦争、内乱、暴動、騒擾、労働争議等により、本サービスの運営が不能となった場合\n13.5本サービス提供のためのシステムの不良および第三者からの不正アクセス、コンピューターウイルスの感染等により本サービスを提供できない場合\n13.6法令等に基づく措置により本サービスが提供できない場合\n13.7その他当社が止むを得ないと判断した場合\n13.8当社は、本サービスの全部または一部を予告なく改訂、追加、または変更することができるものとし、これによりユーザーまたは第三者に損害が発生した場合であっても、一切の責任を負わないものとします。ただし、当社に故意または重過失がありこれにより損害を生じさせた場合は、法令に基づいた上で対応します。\n14.規約の変更\n14.1当社は、当社が必要と判断する場合、いつでも任意の理由で本規約を変更することができます。変更後の本規約は、効力発生日から効力を生じるものとします。\n14.2変更後の利用規約は、当社が別途定める場合を除いて、本サービス上で表示された時点より効力を生じるものとします。\n14.3ユーザーが、本利用規約の変更の効力が生じた後に本サービスを利用する場合には、変更後の利用規約の全ての記載内容に同意したものとみなされます。\n15.本利用規約およびその他の利用規約等の有効性\n15.1本利用規約の規定の一部が法令に基づいて無効と判断されても、本利用規約のその他の規定は有効とします。\n15.2本利用規約の規定の一部があるユーザーとの関係で無効とされ、または取り消された場合でも、本利用規約はその他のユーザーとの関係では有効とします。\n16.準拠法および管轄裁判所\n16.1本利用規約は日本語を正文とし、その準拠法は、日本法とします。\n16.2本サービスに起因、または関連してユーザーと当社との間で訴訟の必要が生じた場合、東京地方裁判所を第一審の専属的合意管轄裁判所します。\n以上\n制定日：2021年9月16日\n株式会社 箸長`
  String get t_and_c_text {
    return Intl.message(
      'うまグラム利用規約\n1.はじめに\n1.1この利用規約（以下「本規約」という。）は、株式会社箸長（以下「当社」といいます。）が提供する「うまグラム」に関連する全ての製品及びサービス（以下「本サービス」といいます。）をご利用いただく際の取り扱いについて、本サービスを利用するお客様（以下「お客様」という。）と当社との間で定めるものです。\n1.2当社が本規約に同意の上、本サービスのユーザーとして登録したもの（以下ユーザーと言います。）に対して、別途以下の各号のものを定めた場合、これらも本規約の一部を構成します。\n1)プライバシーポリシー\n2)当社が本サービスで掲示する諸注意等\n3)本サービスを構成する全ての個別サービスの利用規約・ガイドライン等\n1.3当社は、ユーザーが本サービスを使用することによって健康面や感情面、または商業に関わる利益を保証いたしません。また、本サービス上で提供される情報は、医学的または精神医学、心理学的助言に代わるものではないことにあらかじめ同意の上でユーザーは利用してください。\n1.4本サービスの公式テキストは日本語版のものとします。他の言語への翻訳で作成された矛盾や相違は、拘束力がなく、いかなる目的においても法的効力がないものとします。\n2.定義\n本規約では、以下の用語を使用します。\n2.1「コンテンツ」とは、文章、画像、ソフトウェア、プログラム、コードその他の情報のことをいいます。\n2.2「本コンテンツ」とは、本サービスを通じてアクセスすることができるコンテンツのことを言います。\n3.規約への同意\n3.1本サービスを利用する全てのユーザーは、本規約に従って本サービスを利用しなければなりません。お客様は本規約に同意をしない限り本サービスを利用できません。或いは本サービスの利用開始をもって、本規約に同意したものとみなします。\n3.2ユーザーは、本サービスの利用の都度、本規約の変更の有無を確認し、また変更がなされた場合には、変更後の本規約に同意の上で本サービスを利用していただきます。\n3.3利用者が、本サービスをスマートフォンその他の情報端末にダウンロードし、本規約への同意手続を行った時点で、利用者と当社との間で、本規約の諸規定に従った利用契約が成立するものとします。\n3.4利用者が未成年者である場合には、親権者その他の法定代理人の同意を得たうえで、本サービスをご利用ください。また、お客様が本サービスを事業者のために利用する場合は、当該事業者も本規約に同意した上で本サービスをご利用ください。\n3.5未成年者の利用者が、法定代理人の同意がないにもかかわらず同意があると偽りまたは年齢について成年と偽って本サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合、本サービスに関する一切の法律行為を取り消すことは出来ません。\n3.6本規約の同意時に未成年であった利用者が成年に達した後に本サービスを利用した場合、当該利用者は本サービスに関する一切の法律行為を追認したものとみなされます。\n４.プライバシー\n4.1当社はお客様のプライバシーを尊重しています。\n4.2当社はお客様のプライバシー情報と個人情報を、うまグラムプライバシーポリシーに従って適切に取り扱います。\n5.ユーザーの責任\n5.1ユーザーは、自身の責任において本サービスを利用するものとし、本サービスを利用してなされた一切の行為およびその結果について責任を負います。\n5.2ユーザーは、当社がユーザーの行為に起因して何らかの不利益、負担または損害を被った場合、当社の請求に従い直ちにこれを補償しなければなりません。\n6.ユーザーの禁止行為\n6.1利用者は、本サービスを利用して以下の行為、または以下に該当する恐れのある行為を行ってはいけません。\n１）本サービスを不正の目的をもって利用する行為\n2)当社または第三者の著作権、肖像権、その他知的財産権を侵害する行為\n3)当社または第三者を差別、誹謗中傷、脅迫し、あるいはプライバシー、人権等を侵害する行為\n4)政治活動、選挙活動および宗教活動\n5)当社の名誉・信用を傷付け、信頼を毀損する行為\n6)本サービスの運営を妨げる行為\n7)本サービスを商業目的で利用する行為（当社が認める場合を除く）\n8)本サービスの利用についての再許諾、本サービスの譲渡、変更、翻訳、リバースエンジニアリング、逆コンパイル、逆アセンブルする行為\n9)その他法律、法令、公序良俗に反する行為、またはそのおそれのある行為\n10)その他当社が不適当・不適切と判断した行為\n6.2前項に掲げる行為によって、当社または第三者に損害が生じた場合、ユーザーはすべての法的責任を負うものとし、当社および第三者に損害を与えないものとする。\n6.3当社は、ユーザーが前2項に掲げる行為を行ったと合理的に判断した場合は、事前に通知することなく、本サイトの利用の停止をすることができるものとする。\n7.うまグラム診断\n7.1ユーザーは、本サービスを使用して無料の個人性格診断を受けることができます。\n7.2パーソナリティテストの結果（以下、診断結果という。）は自動的に分析され、アプリ内で解説されます。\n7.3本サービスは、情報や娯楽のユーザー個人の目的でのみ提供され、他の目的で使用されることはありません。\n8.有償コンテンツ\n8.1有償コンテンンツとは「ウマグラム　詳細診断　自己肯定感診断　相性診断　動物診断　満足度診断　運試し」と題する部分のことを指します。\n8.2ユーザーは、有償コンテンツを500円で購入し診断・閲覧することができます。有償コンテンツの金額、決済方法その他の事項は当社が定めるものとします。\n8.3当社は、本サービスにおいて無償または有償とされているコンテンツについて当社の裁量でその価格を変更することがあります。\n8.4有償コンテンツは、これを購入したユーザーのみ利用できるものとする。\n9.有償コンテンツ部分への支払い\n9.1有償コンテンツ部分への支払いは、クレジットカード決済によるものとします。\n9.2. 有償コンテンツ部分への支払いは、当該ユーザーが利用するクレジットカードの発行会社が定める規約に基づき、支払われるものとします。\n9.3. ユーザーは、当社がユーザー登録時に登録を行ったクレジットカード情報について暗号化等の安全化措置を講じるものの、当該情報の秘密性を完全に保持できない場合があることを承諾するものとします。\n9.4ユーザーは、クレジットカードの紛失等によりカード番号が変更となった場合、会員資格を喪失した場合等には、当社に対し速やかにその旨を連絡するものとします。\n10.返金およびキャンセルポリシー\n10.1購入した有償コンテンツは一切払い戻しは行わないものとします。ただし、法令上必要と判断された場合はその限りではありません。\n10.2購入した有償コンテンツの内容は、当社によるコンテンツリニューアルによって内容が変更する場合があります。その場合におきましても、ユーザーはその返金を求めないものとします。\n11.サービスの終了\n11.1当社はユーザーへの適宜の方法で通知することにより、本サービスを終了ですることができるものとします。\n11.2ユーザーは、本サービスが終了した場合、有料コンテンツを利用する権利を一切失い、以後、当該有料コンテンツを利用できなくなることをあらかじめ異議なく同意するものとします。\n11.3当社は、本サービスが原因を問わず終了した場合、これに起因して生じたユーザーまたは第三者が被った被害について、一切責任を負わないものとします。\n12.当社の免責\n12.1当社は、本サービスをユーザーに提供するにあたり、ユーザーが被ったいかなる損害について、法令に定める場合を除き、一切の責任を負いません。なお、当社が責任を負う場合であっても、損害賠償等の金額は、ユーザーが本サービスの利用のために当社に支払った金額を上限とします。\n13.2当社は、ユーザー同士若しくはユーザーと第三者において生じた紛争や損害につき、一切の責任を負いません。\n12.3当社は、本サービス、本サービスにおいて提供される情報、性格診断結果に関して、その正確性、完全性、目的適合性、有用性、適法性、最新性、および第三者の権利を侵害していないことについて、一切保証する義務を負いません。\n13.本サービスの変更、停止または廃止\n13.1当社は、以下各号の事由に起因する場合、本サービスの全部または一部を予告なく停止することができ、かかる停止に起因してユーザーまたは第三者に損害が発生した場合、会社は一切の責任を負いません。\n13.2定期的または緊急に本サービス提供のためのシステムの保守または点検を行う場合\n13.3地震、火災、停電、天災地変等の非常事態により本サービスの運営が不能となった場合\n13.4戦争、内乱、暴動、騒擾、労働争議等により、本サービスの運営が不能となった場合\n13.5本サービス提供のためのシステムの不良および第三者からの不正アクセス、コンピューターウイルスの感染等により本サービスを提供できない場合\n13.6法令等に基づく措置により本サービスが提供できない場合\n13.7その他当社が止むを得ないと判断した場合\n13.8当社は、本サービスの全部または一部を予告なく改訂、追加、または変更することができるものとし、これによりユーザーまたは第三者に損害が発生した場合であっても、一切の責任を負わないものとします。ただし、当社に故意または重過失がありこれにより損害を生じさせた場合は、法令に基づいた上で対応します。\n14.規約の変更\n14.1当社は、当社が必要と判断する場合、いつでも任意の理由で本規約を変更することができます。変更後の本規約は、効力発生日から効力を生じるものとします。\n14.2変更後の利用規約は、当社が別途定める場合を除いて、本サービス上で表示された時点より効力を生じるものとします。\n14.3ユーザーが、本利用規約の変更の効力が生じた後に本サービスを利用する場合には、変更後の利用規約の全ての記載内容に同意したものとみなされます。\n15.本利用規約およびその他の利用規約等の有効性\n15.1本利用規約の規定の一部が法令に基づいて無効と判断されても、本利用規約のその他の規定は有効とします。\n15.2本利用規約の規定の一部があるユーザーとの関係で無効とされ、または取り消された場合でも、本利用規約はその他のユーザーとの関係では有効とします。\n16.準拠法および管轄裁判所\n16.1本利用規約は日本語を正文とし、その準拠法は、日本法とします。\n16.2本サービスに起因、または関連してユーザーと当社との間で訴訟の必要が生じた場合、東京地方裁判所を第一審の専属的合意管轄裁判所します。\n以上\n制定日：2021年9月16日\n株式会社 箸長',
      name: 't_and_c_text',
      desc: '',
      args: [],
    );
  }

  /// `うまグラム利用プライバシーポリシー\n\n1.はじめに\n\n1.1株式会社箸長（以下、「当社」といいます。）は、当社が提供する性格診断アプリうまグラム（以下、「うまグラム」といいます。）およびうまグラムに関連する製品、アプリ、サービス、ウェブサイトなどのすべてのサービス（これらを総称して以下、「当社サービス」といいます。）を提供するにあたり、安心してご利用いただけるよう、お客様の個人に関する情報（以下、「パーソナルデータ」といいます。）を慎重に取扱い、適切な管理・運営に努めてまいります。\n\nこのプライバシーポリシーでは、うまグラムにおいて、パーソナルデータの取扱いについてご説明しており、うまグラムをご利用いただくお客様は、本プライバシーポリシー（以下、「本ポリシー」と言います。）の内容にご同意いただいたものとさせていただきます。\n\nうまグラムの利用にあたってパーソナルデータを取得することはありませんが\n\n本ポリシーは、当社がどのようなパーソナルデータを取得し、それをどのように利用し、共有するか、およびお客様がどのようにご自身のパーソナルデータを管理することができるかをご説明するものです。\n\n2.本ポリシーの利用範囲\n\n本ポリシーは、国や地域を問わず、当社サービスに関連して取得されるすべてのパーソナルデータに適用されます。当社は日本国において適用される法令（これらの法令及び規制を合わせて、以下「適用法」という。）により許容される限りにおいて、本ポリシーに従い、かつ本ポリシーに記載された範囲に限りパーソナルデータを取り扱います。\n\n3.取得するパーソナルデータ\n\nお客様がうまグラムをご利用される際、お客様を特定できるような氏名、住所などの個人情報をご提供いただく必要は原則としてありません。第三者からも同様にパーソナルデータは取得いたしませんので安心してご利用ください。\n\nただし、うまグラムでご提供している以下のサービスのご利用には、お客様の個人情報をご登録いただくものがあります。\n\no 個人情報をご提供いただくサービス\n\n§ ご意見・お問い合わせの受付\n\no ご提供いただく個人情報の例\n\n§ 氏名\n\n§ 社名、役職名\n\n§ 郵便番号、住所、電話番号、ファックス番号\n\n§ E-mail\n\n§ その他各種サービスの提供に必要な情報\n\n2. 当社は、お客様に関して保有するパーソナルデータを以下の目的で使用します。当社は、これらの目的を達成するために必要な範囲内に限ってお客様のパーソナルデータを使用します。\n\no お客様のご意見、お問い合わせの受付、及びこれらのご意見、お問い合わせへの返答\n\no 当社がお客様へ提供する新たなサービスの検討、開発、立上げ\n\no 当社のサービスをお客様により使いやすくなるよう改善すること\n\no 当社のサービスを利用されるお客様に関する分析、統計の収集\n\no 上記に関連する活動\n\no その他、お客様の個人情報を取得する際に明示した利用目的の達成のため\n\no\n\n3. 当社は、以下のいずれかに該当する場合を除き、お客様からご提供いただいたパーソナルデータを第三者に対して開示することはありません。\nお客様の同意がある場合（第三者への開示の必要がある場合は、あらかじめお問い合わせあるいはお申し込みフォーム内でお客様の同意をいただくか、いずれかの方法であらためて確認をさせていただきます。）\n\no 法令にもとづき開示しなければならない場合\n\no 統計情報（都道府県別、業種別、年齢別お客様数等）として、お客様個人を識別できないデータに加工した場合\n\n4. 本プライバシーポリシーを変更した場合、当社は変更後のプライバシーポリシーをうまグラム上に公表し、改訂日を更新します。本ウェブサイト上に公表した後、お客様が初めて本ウェブサイトをご利用された時点で、変更後のプライバシーポリシーに同意いただいたものとさせていただきます。\n\n5. 本プライバシーポリシー又はウェブサイトにおける個人情報の取扱いについてご質問等がある場合は、以下のお問い合せ先にお問い合わせ下さい。\n\n\n2021年4月1日 制定\n\nお問い合わせ\n\n株式会社 箸長\nE-mail: umaglam.special@gmail.com`
  String get privacy_policy_text {
    return Intl.message(
      'うまグラム利用プライバシーポリシー\n\n1.はじめに\n\n1.1株式会社箸長（以下、「当社」といいます。）は、当社が提供する性格診断アプリうまグラム（以下、「うまグラム」といいます。）およびうまグラムに関連する製品、アプリ、サービス、ウェブサイトなどのすべてのサービス（これらを総称して以下、「当社サービス」といいます。）を提供するにあたり、安心してご利用いただけるよう、お客様の個人に関する情報（以下、「パーソナルデータ」といいます。）を慎重に取扱い、適切な管理・運営に努めてまいります。\n\nこのプライバシーポリシーでは、うまグラムにおいて、パーソナルデータの取扱いについてご説明しており、うまグラムをご利用いただくお客様は、本プライバシーポリシー（以下、「本ポリシー」と言います。）の内容にご同意いただいたものとさせていただきます。\n\nうまグラムの利用にあたってパーソナルデータを取得することはありませんが\n\n本ポリシーは、当社がどのようなパーソナルデータを取得し、それをどのように利用し、共有するか、およびお客様がどのようにご自身のパーソナルデータを管理することができるかをご説明するものです。\n\n2.本ポリシーの利用範囲\n\n本ポリシーは、国や地域を問わず、当社サービスに関連して取得されるすべてのパーソナルデータに適用されます。当社は日本国において適用される法令（これらの法令及び規制を合わせて、以下「適用法」という。）により許容される限りにおいて、本ポリシーに従い、かつ本ポリシーに記載された範囲に限りパーソナルデータを取り扱います。\n\n3.取得するパーソナルデータ\n\nお客様がうまグラムをご利用される際、お客様を特定できるような氏名、住所などの個人情報をご提供いただく必要は原則としてありません。第三者からも同様にパーソナルデータは取得いたしませんので安心してご利用ください。\n\nただし、うまグラムでご提供している以下のサービスのご利用には、お客様の個人情報をご登録いただくものがあります。\n\no 個人情報をご提供いただくサービス\n\n§ ご意見・お問い合わせの受付\n\no ご提供いただく個人情報の例\n\n§ 氏名\n\n§ 社名、役職名\n\n§ 郵便番号、住所、電話番号、ファックス番号\n\n§ E-mail\n\n§ その他各種サービスの提供に必要な情報\n\n2. 当社は、お客様に関して保有するパーソナルデータを以下の目的で使用します。当社は、これらの目的を達成するために必要な範囲内に限ってお客様のパーソナルデータを使用します。\n\no お客様のご意見、お問い合わせの受付、及びこれらのご意見、お問い合わせへの返答\n\no 当社がお客様へ提供する新たなサービスの検討、開発、立上げ\n\no 当社のサービスをお客様により使いやすくなるよう改善すること\n\no 当社のサービスを利用されるお客様に関する分析、統計の収集\n\no 上記に関連する活動\n\no その他、お客様の個人情報を取得する際に明示した利用目的の達成のため\n\no\n\n3. 当社は、以下のいずれかに該当する場合を除き、お客様からご提供いただいたパーソナルデータを第三者に対して開示することはありません。\nお客様の同意がある場合（第三者への開示の必要がある場合は、あらかじめお問い合わせあるいはお申し込みフォーム内でお客様の同意をいただくか、いずれかの方法であらためて確認をさせていただきます。）\n\no 法令にもとづき開示しなければならない場合\n\no 統計情報（都道府県別、業種別、年齢別お客様数等）として、お客様個人を識別できないデータに加工した場合\n\n4. 本プライバシーポリシーを変更した場合、当社は変更後のプライバシーポリシーをうまグラム上に公表し、改訂日を更新します。本ウェブサイト上に公表した後、お客様が初めて本ウェブサイトをご利用された時点で、変更後のプライバシーポリシーに同意いただいたものとさせていただきます。\n\n5. 本プライバシーポリシー又はウェブサイトにおける個人情報の取扱いについてご質問等がある場合は、以下のお問い合せ先にお問い合わせ下さい。\n\n\n2021年4月1日 制定\n\nお問い合わせ\n\n株式会社 箸長\nE-mail: umaglam.special@gmail.com',
      name: 'privacy_policy_text',
      desc: '',
      args: [],
    );
  }

  /// `読み込み中`
  String get loading {
    return Intl.message(
      '読み込み中',
      name: 'loading',
      desc: '',
      args: [],
    );
  }

  /// `あなたの強みを◎、○で表しています`
  String get free_result_screen_static_text {
    return Intl.message(
      'あなたの強みを◎、○で表しています',
      name: 'free_result_screen_static_text',
      desc: '',
      args: [],
    );
  }

  /// `自分に最も当てはまるものを一つだけ選んでください`
  String get paid2_questionnaire_static_text {
    return Intl.message(
      '自分に最も当てはまるものを一つだけ選んでください',
      name: 'paid2_questionnaire_static_text',
      desc: '',
      args: [],
    );
  }

  /// `最後に貴方に強運があるかどうかを調べてみましょう。人生の中で運はとても大事な要素です。お遊びのつもりで気楽に、でも真剣に確かめてください。`
  String get fortune_questionnaire_static_text {
    return Intl.message(
      '最後に貴方に強運があるかどうかを調べてみましょう。人生の中で運はとても大事な要素です。お遊びのつもりで気楽に、でも真剣に確かめてください。',
      name: 'fortune_questionnaire_static_text',
      desc: '',
      args: [],
    );
  }

  /// `購入`
  String get purchase {
    return Intl.message(
      '購入',
      name: 'purchase',
      desc: '',
      args: [],
    );
  }

  /// `取消`
  String get cancel {
    return Intl.message(
      '取消',
      name: 'cancel',
      desc: '',
      args: [],
    );
  }

  /// `より深く自分自身の魅力診断を行う有料診断（詳細診断〜運試し）のアプリ内課金、アプリ内での購入は500円で購入することができます。`
  String get in_app_purchase {
    return Intl.message(
      'より深く自分自身の魅力診断を行う有料診断（詳細診断〜運試し）のアプリ内課金、アプリ内での購入は500円で購入することができます。',
      name: 'in_app_purchase',
      desc: '',
      args: [],
    );
  }

  /// `https://tall-reading.surge.sh/privacy-policy.html`
  String get privacy_policy_url {
    return Intl.message(
      'https://tall-reading.surge.sh/privacy-policy.html',
      name: 'privacy_policy_url',
      desc: '',
      args: [],
    );
  }

  /// `https://tall-reading.surge.sh/index.html`
  String get t_and_c_url {
    return Intl.message(
      'https://tall-reading.surge.sh/index.html',
      name: 't_and_c_url',
      desc: '',
      args: [],
    );
  }
}

class AppLocalizationDelegate extends LocalizationsDelegate<S> {
  const AppLocalizationDelegate();

  List<Locale> get supportedLocales {
    return const <Locale>[
      Locale.fromSubtags(languageCode: 'en'),
    ];
  }

  @override
  bool isSupported(Locale locale) => _isSupported(locale);
  @override
  Future<S> load(Locale locale) => S.load(locale);
  @override
  bool shouldReload(AppLocalizationDelegate old) => false;

  bool _isSupported(Locale locale) {
    if (locale != null) {
      for (var supportedLocale in supportedLocales) {
        if (supportedLocale.languageCode == locale.languageCode) {
          return true;
        }
      }
    }
    return false;
  }
}