{
  "questionnaire_output": [
    {
      "min": 0,
      "max": 2,
      "output": "貴方はなかなかいないタイプの人間です。周りの人も貴方とどう付き合ったらいいか思いあぐねています。もっと周囲に貴方から積極的に働きかけることをして貴方の持ち味である信念や真面目さを理解してもらうようにすれば新しい道が開けてくるはずです。"
    },
    {
      "min": 3,
      "max": 5,
      "output": "物事を達観した仙人のようなところがあります。超マイペースで周りの人はなかなか貴方のペースについていけません。そのため貴方がたまに見せる人に対する思いやりや笑顔が大変魅力的に目にうつるものです。この辺りが貴方のチャームポイントになっています。"
    },
    {
      "min": 6,
      "max": 8,
      "output": "消極的にやりがちな点がありますがそのことが貴方の平穏な日常を形成しています。便りのないのは良い便りと言うように貴方の日常は平和なものにっています。他人が真似しようとしても貴方のような生き方をまねできるものではありません。あなたは知らず知らずのうちに周りの人を癒しています。"
    },
    {
      "min": 9,
      "max": 11,
      "output": "貴方は関心や興味のあることに対しては信じられないような力を発揮しますが、そうでないものになると関心を示さないどころか見向きもしないところがあります。好きではないことを無理してやるよりも好きなことだけをするようにして生きることが貴方の持ち味を生かす最っも効果的な方法です。"
    },
    {
      "min": 12,
      "max": 14,
      "output": "性格な判断が貴方の特徴です。貴方がプラスイメージを持って判断した時の決断はまず間違っていないことが多いですが、マイナスイメージでした判断は、時として失敗することがあります。常に前向きな気持ちでいることに心掛けて生活することが貴方の人生に成功をもたらします。"
    },
    {
      "min": 15,
      "max": 17,
      "output": "人付き合いに対して消極的な反面、よく人を観察するため人を見抜く力があります。そのため周囲は貴方に一目置くことがありますが、貴方が積極的になれば周りの人たちも貴方についてくるはずです。貴方は優しい気持ちを持って人と接しますから貴方に近づいた人は必ず安心するはずです。"
    },
    {
      "min": 18,
      "max": 20,
      "output": "貴方の特徴は知らず知らずのうちに周りの人たちを癒してリラックスさせる点にあります。貴方はそのことに気づいていませんが貴方がいることによって場の雰囲気が落ち着くはずです。貴方の持っている他人との距離感は絶妙で近すぎず遠からず、でも必要な空気のような存在になれる人です。"
    },
    {
      "min": 21,
      "max": 23,
      "output": "貴方が好きなことに対して持っている情熱は相当レベルの高いものです。ですから、そのエネルギーに貴方は気がつくべきです。嫌なことを無理してやろうとせず、自分が心から好きなことに絞って物事に挑戦すれば成功確率が跳ね上がります。貴方自身の満足度も高く幸せな気持ちになります。"
    },
    {
      "min": 24,
      "max": 26,
      "output": "本来貴方はじっくり型の人です。急いだり、無理をするとどこかに狂いが生じますが、自分のペースで物事をすれば確実に成し遂げる力を持っています。慌てず今のままのペースでじっくり生きることが貴方の人生の成功につながりますから、自分のやり方を守り続ける勇気と根気が大切です。"
    },
    {
      "min": 27,
      "max": 29,
      "output": "貴方の存在はなかなか神秘的で魅力的な感じを周りに与えています。それは貴方の性格のなかに相対立するものが多く、他人から見るとわかりにくく神秘的に見えるからです。貴方の笑顔は周りの人にとってかなりチャーミングに見えます。笑顔の多い貴方に密かに心を寄せる人がいるはずです。"
    },
    {
      "min": 30,
      "max": 32,
      "output": "貴方は自分から積極的に前に進む様な生き方をもっとすることによって道が開けるタイプです。貴方の美徳である遠慮したり他人の気持ちを優先したりすることで貴方の良さが目立たなくなっています。自分の意見や考えを更に積極的に前面に押しだすともっともっと得なことが起きるはずです。"
    },
    {
      "min": 33,
      "max": 35,
      "output": "貴方は本来とても優しい人です。ただ少し照れ屋なためそれがストレートに表現できないところがあります。一方そんなところが貴方の誠実さと結びついて魅力となっています。貴方と一緒にいるとなんだか安心するという様な人が多いのもそんなわけです。"
    },
    {
      "min": 36,
      "max": 38,
      "output": "寂しがりやで周りの人に認めてもらいたいという気持ちが強くあります。それが貴方の行動の原動力となり基準になっているため、人に優しく親切で時としてお節介なほどになることもあります。そのことががあなたの良さになっていて周りの友達から好かれる原因になっています。"
    },
    {
      "min": 39,
      "max": 41,
      "output": "貴方は十分な能力と魅力を持ち合わせていますがそれらを表に現すのが大変苦手です。そのため時には気持ちと反対のことを言ったりしたりしてしまいます。でも貴方を密かに応援している人も案外多く、彼らは貴方の良さを理解しているので安心して本音で勝負すると良い結果につながります。"
    },
    {
      "min": 42,
      "max": 44,
      "output": "比較的いつも静かで目立たないようにしていますがいざとなると心の強さが表に出て困難を乗り越える強い精神を持っています。そのためはじめに周りの人が貴方から受ける印象より時間が経ってからの印象の方が好意的なものになり付き合いが進むに連れて人から好かれるようになります。"
    },
    {
      "min": 45,
      "max": 47,
      "output": "目立ったり、派手だったりすることが苦手です。そのため周囲に対する観察力が鋭く、適切に相手を評価することができます。いろいろな個性のバランスが良く社会性も優れていますが人に対して自分から積極的に近づこうとはしませんが、本来は高い社会性を持っていますから得意なはずです。"
    },
    {
      "min": 48,
      "max": 50,
      "output": "マイペースで物事を進めるため実行力があります。一方で人の意見を気にしすぎて遠慮がちになったりするところがあります。少々さみしがりやですが自分から社交的に動くことは滅多にありません。その分周りの人からは魅力的神秘的な存在として評価され好かれています。何事のも結果を出すタイプです。"
    },
    {
      "min": 51,
      "max": 53,
      "output": "観察力が優れ周りの人の性格や考えていることが手に取るように判ります。そのためいらぬ神経を使ったりして気苦労が絶えません。周りの人からは信頼されて一目置かれますが気苦労が絶えません。しかし持ち前の明るさと粘り強さで大抵のことは乗り越えてしまいます。空気を読みすぎるタイプです。"
    },
    {
      "min": 54,
      "max": 56,
      "output": "自分の生き方を上手にコントロールできるタイプです。周囲との連絡や協力もそつなくこなし人間関係も大変に上手ですが、本人は苦手意識を持っていたりします。しかし実際には社交的な面が強く周りからも好かれ楽しい日常を過ごしています。一方自分の時間も大切にして充実させています。"
    },
    {
      "min": 57,
      "max": 59,
      "output": "いろいろな意見や考えに興味を持ち積極的にアプローチをするタイプです。そのため人の考えを取り入れて自分の力としていく能力が高くいざという時実力を発揮する個性です。好き嫌いがはっきりしていて好きなことや好きな人に対しては自分をさらけ出して楽しく時間を過ごせます。"
    },
    {
      "min": 60,
      "max": 62,
      "output": "貴方の個性は大変にバランスの良いものです。人に対する思いやりや気配りもふくめ社会性も高く誰からも好かれるものです。多少我儘な点もありますがそれが一つの魅力となり、毎日の生活を楽しみながら幸せな人生をおくることが出来ています。"
    },
    {
      "min": 63,
      "max": 65,
      "output": "良識的、常識的な面とマイペースで物事を遣り通す面とを持っています。そのため人から見ると少し神秘的に見えることがありますが貴方に魅力の一部に成っています。貴方は人から随分好かれていてもそれに気がつかないことがありますからもう少し注意深く周囲を観察しましょう。"
    },
    {
      "min": 66,
      "max": 68,
      "output": "一見厳しい面もありますが心の底から優しい人です。貴方の個性は接する相手によって現れ方が違いますがどんな相手にも優しく接します。楽しいことが大好きで時折ハメを外すこともありますが人の迷惑になることは絶対にしません。明るく楽しく元気の良い個性を持っています。"
    },
    {
      "min": 69,
      "max": 71,
      "output": "貴方はいろいろな個性を持ち合わせているため人を退屈させません。全体のバランスをうまく保って加減よく物事を成し遂げる力を持っているために周りの人からも好かれ楽しい毎日を送るのが上手です。気配りや気遣いも上手で皆を楽しませてくれます。"
    },
    {
      "min": 72,
      "max": 74,
      "output": "楽しく何事も前向きに突き進むパワーと気力があります。貴方ほどのバイタリティーと人をまとめる力はなかなかない個性です。生来真面目な考え方をしますが周りの人は貴方の柔軟さに魅力を感じています。貴方が本来持っている魅力は貴方が前向きになった時に何倍にもなって現れます。"
    },
    {
      "min": 75,
      "max": 80,
      "output": "やる気と前向きな気力で満ち溢れている貴方ですが、つまらないことでつまづいたり元気をなくしてしまうことがあります。それを持ち前の頑張りと努力で乗り越えるのも貴方の素晴らしいところです。将来性も十分有り人の中心になって社会に貢献するすばらしい個性です。"
    }
  ],
  "questionnaire": [
    {
      "classification": "強さ（前向きな推進力、強気、信念、希望がある）",
      "answers": [
        {
          "statement": "前向きに物事を考える",
          "points": 5,
          "result": "常に前向きでエネルギッシュな行動力の持ち主です。"
        },
        {
          "statement": "何事も強気に考えることが多い",
          "points": 4,
          "result": "信念に裏付けられた力強い生き方が貴方の特徴です。"
        },
        {
          "statement": "自分を貫く強い信念がある",
          "points": 3,
          "result": "夢や希望を持ちながら生きるタイプです。"
        },
        {
          "statement": "希望を持って物事を行うことが多い",
          "points": 2,
          "result": "前向きに生きようとするも空回りの傾向があります。"
        },
        {
          "statement": "成し遂げたい夢がある",
          "points": 1,
          "result": "なかなか前向きになれず現実に目を奪われがちです。"
        }
      ]
    },
    {
      "classification": "明るさ（楽しさ、魅力、積極的、お祭り好き）",
      "answers": [
        {
          "statement": "楽しいことが大好きだ",
          "points": 5,
          "result": "人生を楽しく積極的に生きようとします。"
        },
        {
          "statement": "物事は積極的に取り組む方だ",
          "points": 4,
          "result": "周りの人々を明るく楽しませることが得意です。"
        },
        {
          "statement": "お祭り騒ぎが好きだ",
          "points": 3,
          "result": "人の気持ちを読んで上手に雰囲気を作ります。"
        },
        {
          "statement": "明るい人は魅力的だと思う",
          "points": 2,
          "result": "人見知りをしますが基本は人が大好きです。"
        },
        {
          "statement": "少しくらい暗い人も神秘的だと思うことがある",
          "points": 1,
          "result": "さみしがり屋ですが一人でいることも好きなタイプです。"
        }
      ]
    },
    {
      "classification": "協調性（チームワーク、譲歩、仲間意識強い、他力本願）",
      "answers": [
        {
          "statement": "チームワークを考える方だ",
          "points": 5,
          "result": "チームワーク作りが上手く協調性に優れています。"
        },
        {
          "statement": "話によっては相手に譲歩することが多い",
          "points": 4,
          "result": "友人を大切にして仲間意識が高く和を大事にします。"
        },
        {
          "statement": "仲間意識は大切だと思う",
          "points": 3,
          "result": "友達を大事にして話をよく聞く傾向があります。"
        },
        {
          "statement": "自分でやらずに人に頼ることがある",
          "points": 2,
          "result": "仲間意識が強く何事も身内で処理しがちです。"
        },
        {
          "statement": "縁の下の力持ち的な行動が好きだ",
          "points": 1,
          "result": "チームワークも大切にするが自分の意見も言います。"
        }
      ]
    },
    {
      "classification": "自信（行動力、支配的、反省しない、積極的思考）",
      "answers": [
        {
          "statement": "実行力・行動力がある方だ",
          "points": 5,
          "result": "物事を確実に実行する前向きな推進力を持っています。"
        },
        {
          "statement": "人に命令したり仕切ることが多い",
          "points": 4,
          "result": "困難なことも乗り越える強い精神力と実行力があります。"
        },
        {
          "statement": "些細なことは注意されても反省しないことがある",
          "points": 3,
          "result": "積極的にするあまり人の意見を聞かない事があります。"
        },
        {
          "statement": "物事を成功イメージを持って実行することが多い",
          "points": 2,
          "result": "人を上手く仕切って物事を動かすことができます。"
        },
        {
          "statement": "人から非難されても間違ったことをしていなければ構わない",
          "points": 1,
          "result": "行動力がある反面、人の意見を聞かないことがあります。"
        }
      ]
    },
    {
      "classification": "厳しさ（正義感、頑固、カミナリ親父的、真面目）",
      "answers": [
        {
          "statement": "正義感がかなり強い方だ",
          "points": 5,
          "result": "正義感が強いあまり人を追い詰める傾向があります。"
        },
        {
          "statement": "自分の意見を曲げないことがある",
          "points": 4,
          "result": "貴方は真面目さで周りから信頼されるカタブツです。"
        },
        {
          "statement": "物事を真面目に真剣に考えることは重要なことだ",
          "points": 3,
          "result": "やや頑固なところがありカタブツと言われる存在です。"
        },
        {
          "statement": "身近な人に対して口うるさい方だ",
          "points": 2,
          "result": "やや頑固ですが周りから頼られる存在です。"
        },
        {
          "statement": "ずるいことを見ると許せなくなり正したくなる",
          "points": 1,
          "result": "柔軟さもあり人の話も聞いてあげる優しさがあります。"
        }
      ]
    },
    {
      "classification": "優しさ（面倒見、人を認める、同情的、共感、慈悲深い、教育的、リーダー的、平和的）",
      "answers": [
        {
          "statement": "人に対して面倒見がいい方だ",
          "points": 5,
          "result": "愛情豊かで面倒見もよく母性的優しさを持っています。"
        },
        {
          "statement": "人に共感や同情をすることが多い",
          "points": 4,
          "result": "心から共感し人の味方になってあげられる人です。"
        },
        {
          "statement": "人に教えたり人の良さを認めたりするのが好きだ",
          "points": 3,
          "result": "指導力や共感性が高く上司として優れたタイプです。"
        },
        {
          "statement": "人に対して穏やかで平和的な接し方をする方だ",
          "points": 2,
          "result": "面倒見の良さと優しさで誰からも好かれます。"
        },
        {
          "statement": "困っている人を見ると必ず助けたくなる",
          "points": 1,
          "result": "本来は争いを好まない平和主義者です。"
        }
      ]
    },
    {
      "classification": "現実性（冷静さ、理性的、常識的、用心深さ）",
      "answers": [
        {
          "statement": "自分は理性的、理論的で空想的な所はないと思う",
          "points": 5,
          "result": "大人の冷静さと知性を持って物事を上手く解決します。"
        },
        {
          "statement": "物事を現実に沿って常識で考える方だ",
          "points": 4,
          "result": "理性と常識を持ち合わせ大人としての行動をとります。"
        },
        {
          "statement": "人が熱くなっても自分は冷静であることが多い",
          "points": 3,
          "result": "冷静で用心深い性格で周りにいる人を安心させます。"
        },
        {
          "statement": "自分には夢がないなと思うことが多い",
          "points": 2,
          "result": "何事につけ常識を持って無難な処理を行います。"
        },
        {
          "statement": "周りの人の言葉をすぐに信じない方だ",
          "points": 1,
          "result": "常識的な範囲を超えて人をびっくりさせる事が好きです。"
        }
      ]
    },
    {
      "classification": "チャレンジ性（好奇心、貪欲、自由、情熱的）",
      "answers": [
        {
          "statement": "好きなことには挑戦して見たくなる",
          "points": 5,
          "result": "好奇心が強く物事に挑戦する意欲と勇気に溢れています。"
        },
        {
          "statement": "何事においても意欲的に取り組むことが多い",
          "points": 4,
          "result": "チャレンジ精神と情熱があり実行力も持っています。"
        },
        {
          "statement": "伸び伸びと自由な生き方をしたい",
          "points": 3,
          "result": "好奇心が強くのびのびした探究心を持っています。"
        },
        {
          "statement": "目標に向かって突き進んでいる時に生きがいを感じる",
          "points": 2,
          "result": "物事に関心を持つと情熱的に取り組む力があります。"
        },
        {
          "statement": "失敗を恐れず挑戦する方だ",
          "points": 1,
          "result": "興味のあるものはやるがないものに対しては動きません。"
        }
      ]
    },
    {
      "classification": "個を楽しむ（自立、信用しない、マイペース、独善的、一匹狼、無関心）",
      "answers": [
        {
          "statement": "人を頼るより自立することを望む",
          "points": 5,
          "result": "自分のペース通りに行動できる強い精神を持っています。"
        },
        {
          "statement": "人をすぐ信用する方ではない",
          "points": 4,
          "result": "あらゆる事をマイペースで処理する能力を持っています。"
        },
        {
          "statement": "自分をマイペースな人間だと思う",
          "points": 3,
          "result": "やや独りよがりなところがあり自立心が高い性格です。"
        },
        {
          "statement": "一匹狼的な生き方に共感が持てる",
          "points": 2,
          "result": "一人で物事をするのが得意で友達に左右されません。"
        },
        {
          "statement": "人のことには案外無関心な方だ",
          "points": 1,
          "result": "団体競技より個人競技の方が向いているタイプです。"
        }
      ]
    },
    {
      "classification": "誠実さ（良心的、義務的、信用を重んじ 寧さ、几帳面）",
      "answers": [
        {
          "statement": "生き方の中で人に対する誠実さはとても大切だ",
          "points": 5,
          "result": "人に対してとても誠実で良心的で律儀なタイプです。"
        },
        {
          "statement": "人からの信用は最も大事なことの一つだ",
          "points": 4,
          "result": "良心的で誠実ですが時々義務感を持ってしまいます。"
        },
        {
          "statement": "何かにつけて几帳面な方でだらしないことはできない",
          "points": 3,
          "result": "物事をきちんとやらないと気が済まない性格です。"
        },
        {
          "statement": "仕事はスピードや結果より丁寧さや確実さがが大切だ",
          "points": 2,
          "result": "誠実さから人に好かれ頼られるタイプです。"
        },
        {
          "statement": "人から頼まれて仕方なく義務的に何かをすることが時々ある",
          "points": 1,
          "result": "誠実さの中に柔軟さを兼ね備えているタイプです。"
        }
      ]
    },
    {
      "classification": "我慢強さ（辛抱強さ、遠慮がち、粘り強い、諦めない、謙虚）",
      "answers": [
        {
          "statement": "辛抱強く粘り強い性格だ",
          "points": 5,
          "result": "謙虚で我慢強く諦めない芯の強いところが長所です。"
        },
        {
          "statement": "物事を諦めずに最後まで必ずやり遂げたいと思っている",
          "points": 4,
          "result": "粘り強く諦めない古典的な精神力を持っています。"
        },
        {
          "statement": "物事を途中で投げ出すことはまずない",
          "points": 3,
          "result": "謙虚で遠慮っぽい点もありますが強い性格です。"
        },
        {
          "statement": "自分は遠慮深く謙虚な方だ",
          "points": 2,
          "result": "粘り強い面とあっさりとした面をもった大人です。"
        },
        {
          "statement": "一つのことをコツコツとすることが得意だ",
          "points": 1,
          "result": "我慢強さはありませんが謙虚で控えめな点が魅力的です。"
        }
      ]
    },
    {
      "classification": "無邪気さ（冒険心、自己中心、切り替え早い、空想的、大雑把）",
      "answers": [
        {
          "statement": "冒険や探検は不安もあるが好きだ",
          "points": 5,
          "result": "天真爛漫な無邪気さを持って楽しく生きています。"
        },
        {
          "statement": "切り替えが早いとよく人に言われる",
          "points": 4,
          "result": "自己中心的な点はありますが楽しい生き方をしています。"
        },
        {
          "statement": "自分の性格にはどうも子供のような幼さがあるようだ",
          "points": 3,
          "result": "冒険好きな子供のように楽しく生きる事ができる人です。"
        },
        {
          "statement": "自己中心に物事を考えることが多い",
          "points": 2,
          "result": "子供の幼さと大人の常識をバランスよく持っています。"
        },
        {
          "statement": "空想や想像をすることが好きだが現実となると苦手なことも多い",
          "points": 1,
          "result": "常識的な大人の気遣いや我慢のできる人です。"
        }
      ]
    },
    {
      "classification": "責任感（律儀さ、真面目さ、犠牲的、信用重視）",
      "answers": [
        {
          "statement": "責任感がかなり強い方だ",
          "points": 5,
          "result": "人との約束を守り律儀で社会的信用の高い人です。"
        },
        {
          "statement": "人から真面目で律儀だと言われることが多い",
          "points": 4,
          "result": "人から信頼され周りからの評価も高い人です。"
        },
        {
          "statement": "人との約束の時間は目下の人でも必ず守る",
          "points": 3,
          "result": "真面目で人のためを考える信頼度の高い人です。"
        },
        {
          "statement": "人に頼まれるとつい必要以上に頑張ってしまうことがある",
          "points": 2,
          "result": "信用を大事に考える常識的なところが強いです。"
        },
        {
          "statement": "犠牲的精神があり損をすることがあっても頑張ってしまう",
          "points": 1,
          "result": "人のためや自分の信用のために動くタイプです。"
        }
      ]
    },
    {
      "classification": "気が短い（短気、せっかち、話を聞かない、攻撃的）",
      "answers": [
        {
          "statement": "とてもせっかちである",
          "points": 5,
          "result": "とてもせっかちで短気で攻撃的な性格です。"
        },
        {
          "statement": "人の話を最後まで聞かないで自分の話ばかりしてしまう",
          "points": 4,
          "result": "せっかちなため人の話を聞く前に自分から話します。"
        },
        {
          "statement": "ぐずぐずしている人を見ると腹がたつ",
          "points": 3,
          "result": "行動力があり何事も素早く実行します。"
        },
        {
          "statement": "話の途中で我慢できず言い返すことがある",
          "points": 2,
          "result": "ややせっかちですが時々反省して人の話に耳を傾けます。"
        },
        {
          "statement": "短気で、導火線が短い方だ",
          "points": 1,
          "result": "短気なところもありますが落ち着いて物事を考えます。"
        }
      ]
    },
    {
      "classification": "素直さ（柔軟、若い、従順、自己に厳しい）",
      "answers": [
        {
          "statement": "頭が柔らかく柔軟な方だ",
          "points": 5,
          "result": "人の話を聞いて自分の考えを修正する事ができます。"
        },
        {
          "statement": "考え方が若い・幼いと人から言われることがある",
          "points": 4,
          "result": "我を通さずに素直に人の話を聞く事ができます。"
        },
        {
          "statement": "人の言うことを従順に聞くことが多い",
          "points": 3,
          "result": "自分の意見に固執せず人の意見も取り入れます。"
        },
        {
          "statement": "自分自身には結構厳しい所がある",
          "points": 2,
          "result": "方向性をいろいろ持ってよく考えてから動きます。"
        },
        {
          "statement": "自分はひねくれた性格ではないと思う",
          "points": 1,
          "result": "実際の年齢より考え方や行動が若く感じられます。"
        }
      ]
    }
  ]
}